InformationRegisters/УдалитьИсторияОбменаС1САрхивом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>УдалитьИсторияОбменаС1САрхивом</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбменаС1САрхивом</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныеСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектДанных</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьСобытияОбменаС1САрхивом</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияОбменаС1САрхивом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияОбменаС1САрхивом</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КраткоеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияОбменаС1САрхивом</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОтметкаВремени</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтметкаВремениБИА</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновнойОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияОбменаС1САрхивом</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УдалитьИсторияОбменаС1САрхивом/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Добавляет запись в регистр.
//
// Параметры:
//  ОбъектДанных - СправочникСсылка, ДокументСсылка - объект события.
//  ТипСобытия - ПеречислениеСсылка.СобытияОбменаС1САрхивом - тип события.
//  ОписаниеСобытия - Строка - текстовое описание события.
//  СтатусОбмена - ПеречислениеСсылка.СтатусыОбменаС1САрхивом - новый статус для события ИзменениеСтатусаОбмена.
//  ДатаСобытияУниверсальная - Дата, Неопределено - дата события в формате UTC.
//  Пользователь - СправочникСсылка.Пользователи, Неопределено - пользователь, инициировавший событие.
//  ДополнительныеСведения - Строка - поясняющие сведения.
//
Процедура Добавить(
			ОбъектДанных,
			ТипСобытия,
			ОписаниеСобытия = "",
			СтатусОбмена = Неопределено,
			Знач ДатаСобытияУниверсальная = Неопределено,
			Знач Пользователь = Неопределено,
			ДополнительныеСведения = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(ОбъектДанных) Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка при записи в историю обмена: ОбъектДанных не заполнен'");
	КонецЕсли;		

	Если Не ЗначениеЗаполнено(ТипСобытия) Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка при записи в историю обмена: ТипСобытия не заполнен'");
	КонецЕсли;		

	Если Не ЗначениеЗаполнено(ДатаСобытияУниверсальная) Тогда
		ДатаСобытияУниверсальная = ТекущаяУниверсальнаяДата();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.ОбъектДанных = ОбъектДанных;
	Запись.ДатаСобытия = ДатаСобытияУниверсальная;
	Запись.Пользователь = Пользователь;
	Запись.ТипСобытия = ТипСобытия;
	Запись.СтатусОбмена = СтатусОбмена;
	Запись.ОписаниеСобытия = ОписаниеСобытия;
	Запись.ДополнительныеСведения = ДополнительныеСведения;
	Запись.Записать();
	
КонецПроцедуры

// Проверяет наличие записей в регистре.
//
// Параметры:
//  СсылкаНаОбъект - ЛюбаяСсылка - ссылка на объект.
//
// Возвращаемое значение:
//  Булево - Истина, если есть хотя бы одна запись по объекту.
// 
Функция ЕстьЗаписиПоОбъекту(СсылкаНаОбъект) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ИСТИНА КАК ЕстьЗаписи
		|ИЗ
		|	РегистрСведений.ИсторияОбменаС1САрхивом КАК ИсторияОбменаС1САрхивом
		|ГДЕ
		|	ИсторияОбменаС1САрхивом.ОбъектДанных = &СсылкаНаОбъект");
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли
